In [1]:
import os

In [2]:
os.getcwd()

'C:\\Users\\HP'

In [3]:
import pandas as pd

In [12]:
data_4 = pd.read_excel(r'Mydata1.xlsx.xlsx')

In [13]:
data_4

    Name  Age  Salary
0  pinky   30   20000
1   John   22   15000
2   Neha   25   30000
3    Raj   26   35000

In [11]:
pd.read_csv(r'C:\Users\HP\Mydata2.csv.csv')

   Roll No    Name  Batch
0     1001   Pinki   1840
1     1002  Bulbul   1843
2     1003   Shalu   1840
3     1004  Siddhu   1765

In [15]:
pd.read_csv(r'C:\Users\HP\Mydata3.tsv', sep='\t')

   RollNo    Name  Batch
0    1001   pinki   1840
1    1002  siddhu   1842
2    1003  bulbul   1845
3    1004   shalu   1846

# I hope you got it now